In [1]:
%pylab inline
import pandas as pd
import seaborn as sb

Populating the interactive namespace from numpy and matplotlib

In [2]:
data = pd.read_csv('uber-raw-data-apr14.csv')

In [4]:
data

0           4/1/2014 0:11:00
1           4/1/2014 0:17:00
2           4/1/2014 0:21:00
3           4/1/2014 0:28:00
4           4/1/2014 0:33:00
5           4/1/2014 0:33:00
6           4/1/2014 0:39:00
7           4/1/2014 0:45:00
8           4/1/2014 0:55:00
9           4/1/2014 1:01:00
10          4/1/2014 1:19:00
11          4/1/2014 1:48:00
12          4/1/2014 1:49:00
13          4/1/2014 2:11:00
14          4/1/2014 2:25:00
15          4/1/2014 2:31:00
16          4/1/2014 2:43:00
17          4/1/2014 3:22:00
18          4/1/2014 3:35:00
19          4/1/2014 3:35:00
20          4/1/2014 3:41:00
21          4/1/2014 4:11:00
22          4/1/2014 4:15:00
23          4/1/2014 4:19:00
24          4/1/2014 4:20:00
25          4/1/2014 4:26:00
26          4/1/2014 4:27:00
27          4/1/2014 4:38:00
28          4/1/2014 4:47:00
29          4/1/2014 4:49:00
                 ...
564486    4/30/2014 22:25:00
564487    4/30/2014 22:25:00
564488    4/30/2014 22:25:00
564489    4/30/2014 22:26:00
564490    4/30/2014 22:27:00
564491    4/30/2014 22:27:00
564492    4/30/2014 22:28:00
564493    4/30/2014 22:29:00
564494    4/30/2014 22:32:00
564495    4/30/2014 22:35:00
564496    4/30/2014 22:36:00
564497    4/30/2014 22:42:00
564498    4/30/2014 22:46:00
564499    4/30/2014 22:47:00
564500    4/30/2014 22:50:00
564501    4/30/2014 22:51:00
564502    4/30/2014 22:56:00
564503    4/30/2014 22:57:00
564504    4/30/2014 22:58:00
564505    4/30/2014 22:58:00
564506    4/30/2014 23:00:00
564507    4/30/2014 23:04:00
564508    4/30/2014 23:05:00
564509    4/30/2014 23:15:00
564510    4/30/2014 23:18:00
564511    4/30/2014 23:22:00
564512    4/30/2014 23:26:00
564513    4/30/2014 23:31:00
564514    4/30/2014 23:32:00
564515    4/30/2014 23:48:00
Name: Date/Time, Length: 564516, dtype: object

In [5]:
data['Date/Time']

0           4/1/2014 0:11:00
1           4/1/2014 0:17:00
2           4/1/2014 0:21:00
3           4/1/2014 0:28:00
4           4/1/2014 0:33:00
5           4/1/2014 0:33:00
6           4/1/2014 0:39:00
7           4/1/2014 0:45:00
8           4/1/2014 0:55:00
9           4/1/2014 1:01:00
10          4/1/2014 1:19:00
11          4/1/2014 1:48:00
12          4/1/2014 1:49:00
13          4/1/2014 2:11:00
14          4/1/2014 2:25:00
15          4/1/2014 2:31:00
16          4/1/2014 2:43:00
17          4/1/2014 3:22:00
18          4/1/2014 3:35:00
19          4/1/2014 3:35:00
20          4/1/2014 3:41:00
21          4/1/2014 4:11:00
22          4/1/2014 4:15:00
23          4/1/2014 4:19:00
24          4/1/2014 4:20:00
25          4/1/2014 4:26:00
26          4/1/2014 4:27:00
27          4/1/2014 4:38:00
28          4/1/2014 4:47:00
29          4/1/2014 4:49:00
                 ...
564486    4/30/2014 22:25:00
564487    4/30/2014 22:25:00
564488    4/30/2014 22:25:00
564489    4/30/2014 22:26:00
564490    4/30/2014 22:27:00
564491    4/30/2014 22:27:00
564492    4/30/2014 22:28:00
564493    4/30/2014 22:29:00
564494    4/30/2014 22:32:00
564495    4/30/2014 22:35:00
564496    4/30/2014 22:36:00
564497    4/30/2014 22:42:00
564498    4/30/2014 22:46:00
564499    4/30/2014 22:47:00
564500    4/30/2014 22:50:00
564501    4/30/2014 22:51:00
564502    4/30/2014 22:56:00
564503    4/30/2014 22:57:00
564504    4/30/2014 22:58:00
564505    4/30/2014 22:58:00
564506    4/30/2014 23:00:00
564507    4/30/2014 23:04:00
564508    4/30/2014 23:05:00
564509    4/30/2014 23:15:00
564510    4/30/2014 23:18:00
564511    4/30/2014 23:22:00
564512    4/30/2014 23:26:00
564513    4/30/2014 23:31:00
564514    4/30/2014 23:32:00
564515    4/30/2014 23:48:00
Name: Date/Time, Length: 564516, dtype: object

In [6]:
data.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [7]:
data.tail()

                 Date/Time      Lat      Lon    Base
564511  4/30/2014 23:22:00  40.7640 -73.9744  B02764
564512  4/30/2014 23:26:00  40.7629 -73.9672  B02764
564513  4/30/2014 23:31:00  40.7443 -73.9889  B02764
564514  4/30/2014 23:32:00  40.6756 -73.9405  B02764
564515  4/30/2014 23:48:00  40.6880 -73.9608  B02764

In [8]:
dt = 4/30/2014 23:22:00

SyntaxError: invalid syntax (<ipython-input-8-41a465822ff6>, line 1)

In [9]:
dt = '4/30/2014 23:22:00'

In [10]:
d, t = dt.split(' ')
print(d)
print(t)

4/30/2014
23:22:00

In [11]:
m,d,y = d.split('/')

In [12]:
m
d
y

'2014'

In [13]:
m

'4'

In [14]:
d

'30'

In [15]:
d1=int(d)

In [16]:
d1

30

In [17]:
dt

'4/30/2014 23:22:00'

In [18]:
dt.month

AttributeError: 'str' object has no attribute 'month'

In [20]:
dt = pd.to_datetime(dt)

In [21]:
dt

Timestamp('2014-04-30 23:22:00')

In [22]:
dt.month

4

In [23]:
dt.year

2014

In [24]:
dt.week

18

In [26]:
data['Date/Time'] = data['Date/Time'].map(pd.to_datetime)